app/views/student_tutor/show.html.erb

<%if @user == nil%>
<p> <%Subject.all.each do |subject|%>
---
SELECT "subjects".* FROM "subjects"


<%=collection_select(:subject_id, :subject_id, Subject.all, :id, :name, prompt: false)%>
---
SELECT "subjects".* FROM "subjects"

<%=@sid%>
<p> Your Subject name <%=Subject.find(@sid).name%>
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]