app/views/tutor_subjects/show.html.erb

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

  <li><%=Subject.find(subject).name%> </li>

SELECT "subjects".* FROM "subjects"
---

<%=collection_select(:subject_id, :subject_id, Subject.all, :id, :name, prompt: true)%>