app/views/users/subject.html.erb


  <li><%=Subject.find(subject).name%> </li>
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]