app/controllers/student_tutor_controller.rb

SELECT  "tutor_subjects".* FROM "tutor_subjects" WHERE "tutor_subjects"."subject_id" = ? AND "tutor_subjects"."tutor_id" = ? LIMIT ?  [["subject_id", 3], ["tutor_id", 4], ["LIMIT", 1]]
INSERT INTO "student_tutors" ("tutor_subject_id", "student_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tutor_subject_id", 34], ["student_id", 5], ["status", "p"], ["created_at", "2019-04-17 21:39:58.628371"], ["updated_at", "2019-04-17 21:39:58.628371"]]
---
    def create
       @@s
       tutor_id = params[:tutor_id][:tutor_id]
        @tutor_id = tutor_id.to_i

        student_id = params[:id]
        @studentid = student_id.to_i
        @subject_id =@@s
 #   if TutorSubject.find_by(subject_id: @subject_id,tutor_id: @tutor_id) == nil
        @tutorsubject =TutorSubject.find_by(subject_id: @subject_id,tutor_id: @tutor_id)
        new = StudentTutor.new
        new.tutor_subject_id = @tutorsubject.id
        new.student_id = @studentid
        new.status = "p"
        new.save

SELECT  "tutor_subjects".* FROM "tutor_subjects" WHERE "tutor_subjects"."tutor_id" = ? AND "tutor_subjects"."id" = ? LIMIT ?  [["tutor_id", 2], ["id", 29], ["LIMIT", 1]]
SELECT "student_tutors".* FROM "student_tutors" WHERE "student_tutors"."status" = ?  [["status", "p"]]
---
   def tutorrequest
    @store = []
    id = params[:id].to_i
    @tutorial =  TutorSubject.where(tutor_id: id)
    @studenttutor = StudentTutor.where(status: "p")
    @studenttutor.each do |student|
    if @tutorial.find_by(id: student.tutor_subject_id) != nil

SELECT "subjects".* FROM "subjects"
SELECT "tutor_subjects".* FROM "tutor_subjects"
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "tutor_subjects".* FROM "tutor_subjects" WHERE "tutor_subjects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def post
        @message = nil
        subjectid = params[:subject_id].values
        subid = subjectid[0]
        @sid = subid.to_i
        @@s = @sid
        @studentid = params[:id]
        @tutor = []
        @user = []
        @test = params[:id]
        TutorSubject.all.each do |tutor|
            if tutor.subject_id == @sid
                @tutor << tutor.tutor_id
            end
        end
         @tutor.each do |user|
            @user << User.all.find(user)