app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "data science"], ["status", ""], ["created_at", "2019-04-16 20:45:44.391944"], ["updated_at", "2019-04-16 20:45:44.391944"]]