app/controllers/tutor_subjects_controller.rb

  def index
    @tutor_subjects = TutorSubject.all
---
SELECT "tutor_subjects".* FROM "tutor_subjects"

  def show
    @user = User.find(params[:id])

     @existing = [1,2]
     @test  = "this is test"
     TutorSubject.all.each do |subject|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"
SELECT "tutor_subjects".* FROM "tutor_subjects"

    def set_tutor_subject
      @tutor_subject = TutorSubject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "tutor_subjects".* FROM "tutor_subjects" WHERE "tutor_subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]