app/controllers/tutor_subjects_controller.rb

    def set_tutor_subject
      @tutor_subject = TutorSubject.find(params[:id])
---
SELECT  "tutor_subjects".* FROM "tutor_subjects" WHERE "tutor_subjects"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]