app/controllers/users_controller.rb

   def subjects
  @user = User.find(params[:id])

   @existing = []
   @notincluded = []
   @subjecttochoose = []
   @final = []
   @subjectnames = []
   TutorSubject.all.each do |subject|

    if subject.tutor_id == @user.id
      @existing << subject.subject_id

    end
     end

     Subject.all.each do |subject|

     @subjecttochoose << subject.id

     end
     @final = @subjecttochoose - @existing

     @final.each do |subject|
       @subjectnames << Subject.all.find(subject)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"
SELECT "tutor_subjects".* FROM "tutor_subjects"
INSERT INTO "tutor_subjects" ("tutor_id", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tutor_id", 1], ["subject_id", 3], ["created_at", "2019-04-16 23:29:40.521620"], ["updated_at", "2019-04-16 23:29:40.521620"]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def subjectupdate
      @userid =  params[:id]
      @subjectid = params[:subject_id].values
      @subjectid.join
      @subject = @subjectid[0].to_i
      new = TutorSubject.new
       new.tutor_id = @userid
       new.subject_id = @subject
       new.save
---
INSERT INTO "tutor_subjects" ("tutor_id", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tutor_id", 2], ["subject_id", 5], ["created_at", "2019-04-17 00:57:12.865950"], ["updated_at", "2019-04-17 00:57:12.865950"]]